{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Alert_name": {
      "type": "string",
      "metadata": {
        "description": "Name of the Alert"
      }
    },
    "automationAccountName": {
      "type": "string",
      "metadata": {
        "description": "Name of the Automation Account"
      }
    },
    "ActionGroupName": {
      "type": "string",
      "defaultValue": "AccessReview",
      "metadata": {
        "description": "Name of Actiongroup in Alert"
      }
    },
    "WorkspaceID": {
      "type": "string",
      "metadata": {
        "description": "ResourceID of workspace where audit log is collected"
      }
    },
    "ClientID": {
      "type": "string",
      "metadata": {
        "description": "Enter App ID"
      }
    },
     "TenantID": {
      "type": "string",
      "metadata": {
        "description": "Enter Tenant ID"
      }
    },
     "Secret": {
      "type": "securestring",
      "metadata": {
        "description": "Enter App Secret"
      }
    },
    "Username": {
      "type": "string",
      "metadata": {
        "description": "Username of Mailbox that will be used to send mail"
      }
    },
    "Password": {
      "type": "securestring",
      "metadata": {
        "description": "Password of Mailbox that would be used to send mail"
      }
    },
    "ToEmailAddress": {
      "type": "string",
      "metadata": {
        "description": "Password of Mailbox that would be used to send mail"
      }
    }
  },
  "functions": [],
  "variables": {
    "RunBookName": "AccessReview-Run"
  },
  "resources": [
    {
      "type": "Microsoft.Automation/automationAccounts",
      "apiVersion": "2020-01-13-preview",
      "name": "[parameters('automationAccountName')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "sku": {
          "name": "Basic"
        }
      },
      "resources": [
        {
          "type": "runbooks",
          "apiVersion": "2018-06-30",
          "name": "[variables('RunBookName')]",
          "location": "[resourceGroup().location]",
          "dependsOn": ["[parameters('automationAccountName')]"],
          "properties": {
            "runbookType": "PowerShell",
            "logProgress": "false",
            "logVerbose": "false",
            "publishContentLink": {
              "uri": "https://raw.githubusercontent.com/gobimages/PersonalScripts/master/AccessReview.ps1",
              "version": "1.0.0.0"
            }
          }
        },
        {
          "name": "Secret",
          "dependsOn": ["[parameters('automationAccountName')]"],
          "type": "variables",
          "apiVersion": "2015-10-31",
          "properties": {
            "value": "[concat('\"',parameters('Secret'),'\"')]",
            "description": "Enter APP secret",
            "isEncrypted": true
          }
        },
        {
          "name": "TenantID",
          "dependsOn": ["[parameters('automationAccountName')]"],
          "type": "variables",
          "apiVersion": "2015-10-31",
          "properties": {
            "value": "[concat('\"',parameters('TenantID'),'\"')]",
            "description": "Enter Tenant ID",
            "isEncrypted": false
          }
        },
        {
          "name": "Address",
          "dependsOn": ["[parameters('automationAccountName')]"],
          "type": "variables",
          "apiVersion": "2015-10-31",
          "properties": {
            "value": "[concat('\"',parameters('ToEmailAddress'),'\"')]",
            "description": "Enter Email address you want email to be delivered",
            "isEncrypted": false
          }
        },
        {
          "name": "ClientID",
          "dependsOn": ["[parameters('automationAccountName')]"],
          "type": "variables",
          "apiVersion": "2015-10-31",
          "properties": {
            "value": "[concat('\"', parameters('ClientID'), '\"')]",
            "description": "Enter Application ID",
            "isEncrypted": false
          }
        },
        {
          "name": "Email",
          "dependsOn": ["[parameters('automationAccountName')]"],
          "type": "credentials",
          "apiVersion": "2015-10-31",
          "properties": {
            "userName": "[parameters('Username')]",
            "password": "[parameters('Password')]",
            "description": "Enter the Email Credentials of mailbox that will be used to send Message"
          }
        }
      ]
    },
    {
      "type": "microsoft.insights/actionGroups",
      "apiVersion": "2019-03-01",
      "name": "[parameters('ActionGroupName')]",
      "location": "Global",
      "properties": {
        "groupShortName": "AccessReview",
        "enabled": true,
        "emailReceivers": [],
        "smsReceivers": [],
        "webhookReceivers": [],
        "itsmReceivers": [],
        "azureAppPushReceivers": [],
        "automationRunbookReceivers": [],
        "voiceReceivers": [],
        "logicAppReceivers": [],
        "azureFunctionReceivers": []
      }
    },
    {
      "type": "microsoft.insights/scheduledqueryrules",
      "apiVersion": "2018-04-16",
      "name": "[parameters('Alert_name')]",
      "location": "[resourceGroup().location]",
      "dependsOn": [
        "[resourceId('microsoft.insights/actionGroups', parameters('ActionGroupName'))]"
      ],
      "properties": {
        "enabled": "true",
        "source": {
          "query": "AuditLogs\n| where Category contains \"Policy\" and ActivityDisplayName contains \"Access review ended\"\n| extend id_ = tostring(TargetResources[0].id)\n| extend ReviewID = id_\n| project  ReviewID\n",
          "authorizedResources": [],
          "dataSourceId": "[parameters('WorkspaceID')]",
          "queryType": "ResultCount"
        },
        "schedule": {
          "frequencyInMinutes": 5,
          "timeWindowInMinutes": 15
        },
        "action": {
          "severity": "4",
          "aznsAction": {
            "actionGroup": [
              "[resourceId('microsoft.insights/actionGroups', parameters('ActionGroupName'))]"
            ]
          },
          "trigger": {
            "thresholdOperator": "GreaterThan",
            "threshold": 0
          },
          "odata.type": "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
        }
      }
    }
  ],
  "outputs": {}
}
